// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length>=3) {
    console.log('Це великий масив, у якому 3 і більше елементи.');
}else{
    console.log('Це маленький масив, у якому менше 3 елементів.');
}

console.log('------------------------------');

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 4;
let b=3;
let c=5;

if ((a>b && a<c) || (a>c && a<b)){
    console.log(`Середнє число: ${a}`);
}else if((b>a && b<c) || (b>c && b<a)){
    console.log(`Середнє число: ${b}`);
}else if((c>a && c<b) || (c>b && c<a)){
    console.log(`Середнє число: ${c}`);
}else{
    console.log('Введіть числа');
}

console.log('------------------------------');

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

a=1;
b=2;

let result=(a+b <4)? 'Мало': 'Багато';
console.log(result);

console.log('------------------------------');

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

num=-50;

let number = (num>=-100 && num<0)? "Від'ємне число!":
    (num===0)? "Число є нулем!":
        (num<=100 && num>0)? "Додатнє число!": 'Введіть число від -100 до 100!';
console.log(number);

console.log('------------------------------');

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test= 1;
let testResult=test? 'Вірно' : 'Неправильно';
console.log(testResult);

console.log('------------------------------');

let test1 = true;
if (test1){
    console.log('Вірно');
}else{
    console.log('Неправильно');
}

console.log('------------------------------');

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let name = prompt('Яка «офіційна» назва JavaScript?');

if (name==='ECMAScript'){
    console.log('Правильно');
}else
    console.log('Не знаєте? ECMAScript!');

console.log('------------------------------');

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let numOfFlat= 20;

if (numOfFlat>=1 && numOfFlat<=20){
    console.log("Квартира у першому під'їзді!");
}else if (numOfFlat>=21 && numOfFlat<=48){
    console.log("Квартира у другому під'їзді!");
}else if (numOfFlat>=49 && numOfFlat<=90){
    console.log("Квартира у третьому під'їзді!");
}else{
    console.log("Введіть номер квартири 1-90!");
}

console.log('------------------------------');

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

let number1= +prompt('Введіть число:');

if (number1===10){
    console.log('Вірно');
}else{
    console.log('Невірно');
}

console.log('------------------------------');

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temp= 8;

if (temp>=10 && temp<=22){
    console.log('Ми йдемо вчитися!');
}else{
    console.log('Сидимо вдома і вчимося онлайн!');
}

console.log('------------------------------');

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне.

let gameNum= +prompt('Введіть число від 1 до 5:');

switch (gameNum){
    case 1:
        console.log('Ви виграли автомобіль!');
        break;
    case 2:
        console.log('Ви виграли мотоцикл!');
        break;
    case 3:
        console.log('Ви виграли телефон!');
        break;
    case 4:
        console.log('Ви виграли гроші!');
        break;
    case 5:
        console.log('Ви нічого не виграли!');
        break;
    default:
        console.log('Число не вірне!');
        break;
}

console.log('------------------------------');